---
kind: property
id: P:Autodesk.Revit.DB.Architecture.HandRailType.Height
zh: 高度
source: html/9b983eef-3e5f-180e-76e4-80f56c002932.htm
---
# Autodesk.Revit.DB.Architecture.HandRailType.Height Property

**中文**: 高度

The height of the handrail.

## Syntax (C#)
```csharp
public double Height { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for height must be between 0 and 30000 feet.